; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	thermograph1 - mode
	thermograph5 - mode
	image3 - mode
	infrared0 - mode
	thermograph4 - mode
	infrared6 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star4 - direction
	Star2 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared0)
	(supports instrument1 image3)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph5)
	(calibration_target instrument2 Star1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 Star2)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument6 thermograph4)
	(supports instrument6 infrared6)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
	(supports instrument7 infrared2)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star4)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
)
(:goal (and
	(pointing satellite2 Phenomenon10)
	(have_image Planet5 infrared2)
	(have_image Planet6 infrared6)
	(have_image Star7 infrared6)
	(have_image Star7 infrared2)
	(have_image Planet8 thermograph5)
	(have_image Planet9 thermograph5)
	(have_image Planet9 thermograph4)
	(have_image Phenomenon10 thermograph4)
))

)

; plan
1. (turn_to satellite4 groundstation3 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 groundstation3)
   goals met: 1 of 9
2. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 1 of 9
3. (calibrate satellite4 instrument7 groundstation3)
   added: (calibrated instrument7)
   goals met: 1 of 9
4. (turn_to satellite4 planet5 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 planet5)
   goals met: 1 of 9
5. (turn_to satellite3 star1 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star1)
   goals met: 1 of 9
6. (turn_to satellite1 star1 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star1)
   goals met: 1 of 9
7. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 1 of 9
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 9
9. (calibrate satellite3 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 1 of 9
10. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 1 of 9
11. (take_image satellite4 planet5 instrument7 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 2 of 9
12. (turn_to satellite1 planet8 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet8)
   goals met: 2 of 9
13. (take_image satellite1 planet8 instrument2 thermograph5)
   added: (have_image planet8 thermograph5)
   goals met: 3 of 9
14. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 3 of 9
15. (take_image satellite1 planet9 instrument2 thermograph5)
   added: (have_image planet9 thermograph5)
   goals met: 4 of 9
16. (turn_to satellite3 phenomenon10 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon10)
   goals met: 4 of 9
17. (take_image satellite3 phenomenon10 instrument6 thermograph4)
   added: (have_image phenomenon10 thermograph4)
   goals met: 5 of 9
18. (turn_to satellite3 planet6 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 planet6)
   goals met: 5 of 9
19. (take_image satellite3 planet6 instrument6 infrared6)
   added: (have_image planet6 infrared6)
   goals met: 6 of 9
20. (turn_to satellite3 planet9 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 planet9)
   goals met: 6 of 9
21. (take_image satellite3 planet9 instrument6 thermograph4)
   added: (have_image planet9 thermograph4)
   goals met: 7 of 9
22. (turn_to satellite3 star7 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star7)
   goals met: 7 of 9
23. (take_image satellite3 star7 instrument6 infrared6)
   added: (have_image star7 infrared6)
   goals met: 8 of 9
24. (turn_to satellite4 star7 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 star7)
   goals met: 8 of 9
25. (take_image satellite4 star7 instrument7 infrared2)
   added: (have_image star7 infrared2)
   goals met: 9 of 9
